In [1]:
import pandas as pd
import numpy as np

In [2]:
PATH_EVENTOS    = "eventos.csv"
PATH_PAGOS      = "pagos.csv"
PATH_USUARIOS   = "usuarios.csv"

In [4]:
eventos     = pd.read_csv(PATH_EVENTOS)
pagos       = pd.read_csv(PATH_PAGOS)
usuarios    = pd.read_csv(PATH_USUARIOS)

In [6]:
eventos.head()

   user_id fecha_evento tipo_evento dispositivo
0        1   2023-02-06       login     Android
1        1   2023-01-25      compra     Android
2        1   2024-03-27      compra         Web
3        1   2023-02-03       login     Android
4        1   2023-04-29      compra         Web

In [7]:
pagos.head()

   pago_id  user_id  fecha_pago  monto      metodo_pago  fraude
0        1     3387  2024-01-11  25.44  Tarjeta Crédito       0
1        2     3892  2023-07-05  18.53  Tarjeta Crédito       0
2        3     2743  2023-06-28  35.90  Tarjeta Crédito       0
3        4     2935  2023-09-07   0.30  Tarjeta Crédito       0
4        5     3972  2024-06-05   1.48           Débito       0

In [8]:
usuarios.head()

   user_id      pais fecha_registro canal_adquisicion
0        1    México     2022-07-24          Orgánico
1        2  Colombia     2023-12-03          Orgánico
2        3      Perú     2023-03-03          Referido
3        4      Perú     2022-03-16          Facebook
4        5  Colombia     2022-06-12          Referido

----------------------------------

In [10]:
eventos.describe(include="object")

       fecha_evento tipo_evento dispositivo
count         25293       25293       25293
unique          600           3           3
top      2023-11-27       login         Web
freq             63       15165        8517

In [11]:
pagos.describe(include="object")

        fecha_pago      metodo_pago
count        20000            20000
unique         600                4
top     2023-01-19  Tarjeta Crédito
freq            52            10018

In [12]:
usuarios.describe(include="object")

            pais fecha_registro canal_adquisicion
count       5000           5000              5000
unique         5            800                 4
top     Colombia     2023-06-27          Referido
freq        1061             14              1265